{
  "About Varen": "เกี่ยวกับ Varen",
  "Accept": "ตกลง",
  "Account": "บัญชีผู้ใช้งาน",
  "Add": "เพิ่ม",
  "Amount": "จำนวน",
  "An error occurred when trying to execute this swap. You may need to increase your slippage tolerance. If that does not work, there may be an incompatibility with the token you are trading. Note fee on transfer and rebase tokens are incompatible with Uniswap V3.": "เกิดข้อผิดพลาดขณะพยายามดำเนินการสับเปลี่ยน คุณอาจต้องเพิ่มการกำหนดค่าความคลาดเคลื่อนโดยรวมใหม่ หากไม่ได้ผล อาจมีความไม่เข้ากันกับ Token ที่คุณกำลังซื้อขาย หมายเหตุ ค่าธรรมเนียมการโอนและโทเค็น ทำรีเบสไม่ได้กับ Uniswap V3 ",
  "Approve Swap": "การแลกเปลี่ยนได้รับการอนุมัติ",
  "Approve {0}": "อนุมัติ {0} ",
  "Arbitrum Bridge": "อารบิทรัม บริดจ์",
  "Are you sure?": "คุณแน่ใจที่จะทำรายการนี้ใช่ไหม?",
  "Auto": "อัตโนมัติ",
  "Available Networks": "เครือข่ายที่มีอยู่",
  "Balance:": "จำนวนยอดเงินที่ฝากในบัญชีทั้งหมด",
  "Cancelled": "ยกเลิก",
  "Celo Bridge": "เซโล บริดจ์",
  "Change": "ทำการแลกเปลี่ยน",
  "Clear all": "ล้างข้อมูลทั้งหมด",
  "Close": "ปิด",
  "Confirm this transaction in your wallet": "ยืนยันการทำรายการนี้ในบัญชีของคุณ",
  "Confirmations": "ทำการยืนยัน",
  "Confirmed": "ยืนยันเรียบร้อยแล้ว",
  "Connect to a wallet": "ทำการเชื่อมต่อบัญชีวอลเล็ท",
  "Contribute Now!": "บริจาคทันที",
  "Copied": "คัดลอกข้อมูลเรียบร้อยแล้ว",
  "Copy Address": "คัดลอกที่อยู่",
  "Cross-Chain Swap": "แลกเปลี่ยนแบบครอสเชน",
  "Dev": "การพัฒนา",
  "Disconnect": "ไม่สามารถเชื่อมต่อได้",
  "Discord": "ดิสคอร์ด",
  "Dismiss": "ปล่อย หรือ พลาด",
  "Docs": "เอกสารทั้งหมด",
  "Documentation": "เอกสาร",
  "Documentation for developers of Sushi.": "เอกสารสำหรับเหล่านักพัฒนาของซูชิ",
  "Documentation for users of Sushi.": "เอกสารสำหรับผู้ใช้ของซูชิ",
  "Either return to the {link}, or change to an available network.": "กลับไปที่ {link} หรือเปลี่ยนเป็นเครือข่ายที่พร้อมใช้งาน",
  "Enter a valid slippage percentage": "ป้อนค่าความคลาดเคลื่อนระหว่างราคาซื้อขายเป็นเปอร์เซ็นต์",
  "Enter an amount": "ป้อนจำนวนเงิน",
  "Error": "ไม่สำเร็จ เกิดข้อผิดพลาดบางอย่าง",
  "Error connecting": "ทำการเชื่อมต่อไม่สำเร็จ",
  "Error connecting. Try refreshing the page.": "ทำการเชื่อมต่อไม่สำเร็จ กำลังพยายามเชื่อมต่อหน้าเพจนี้อีกครั้ง",
  "Error while trying to connect": "เกิดข้อผิดพลาดขณะกำลังพยายามเชื่อมต่อ",
  "Exchange Rate": "อัตราการแลกเปลี่ยน",
  "Executing": "กำลังดำเนินการ",
  "Executing FreeWei": "FreeWei กำลังดำเนินการ",
  "Expanded results from inactive Token Lists": "ขยายผลลัพธ์จากรายการโทเค็นที่ไม่ได้ใช้งาน",
  "Expert Mode": "โหมดผู้เชียวชาญ",
  "Expert mode turns off the confirm transaction prompt and allows high slippage trades\nthat often result in bad rates and lost funds.": "โหมดผู้เชี่ยวชาญจะปิดการแจ้งยืนยันการทำธุรกรรมและอนุญาตให้มีการซื้อขายสูง \n ที่มักจะส่งผลให้อัตราแลกเปลี่ยนที่ไม่ดีและอาจจะสูญเสียเงิน",
  "Failed": "ล้มเหลว",
  "FreeWei covers gast costs for transactions that include a mint.": "FreeWei ครอบคลุมค่าน้ำมันสำหรับธุรกรรมที่มีการใช้เหรียญกษาปณ์",
  "FreeWei status": "สถานะ FreeWei",
  "Gateway:": "เกตเวย์",
  "Generating gateway address": "ทำการสร้างที่อยู่เกตเวย์",
  "Github": "เว็บไซต์ที่ให้บริการกิฟท์",
  "Go Back": "ย้อนกลับ",
  "Governance Forum": "หัวข้อนโยบาย",
  "Harmony Bridge": "ฮาร์โมนี บริดจ์",
  "Import": "นำเข้าข้อมูล",
  "Import List": "นำเข้ารายการทั้งหมด",
  "Initializing": "กำลังเริ่มต้น",
  "Insufficient {0} balance": "สภาพคล่องไม่มี จำนวนเงินที่มีอยู่เท่ากับ {0}",
  "Intermediary swaps": "สับเปลี่ยนตัวกลางทางการเงิน",
  "Join the community on Discord.": "เข้าร่วมชุมชนบนดิสคอร์ด",
  "Learn more about wallets": "เรียนรู้เพิ่มเติมเกี่ยวกับการใช้บัญชีวอลเลต",
  "Lists": "รายการทั้งหมด",
  "Loading": "กำลังโหลด",
  "Manage": "จัดการ",
  "Manage Token Lists": "จัดการรายการโทเค็น",
  "Matic Bridge": "แมทิค บริดจ์",
  "Medium": "ปานกลาง",
  "Miner Tip": "เคล็ดลับการขุด",
  "Moonriver Bridge": "มูนริเวอร์ บริดจ์",
  "Native-Chains": "เนทีฟ เชน",
  "New to Ethereum?": "ใหม่ไปยังอีเธอร์เลียม",
  "No results found": "ไม่พบผลลัพธ์",
  "ONLY USE THIS MODE IF YOU KNOW WHAT YOU ARE DOING.": "ใช้โหมดนี้ก็ต่อเมื่อคุณรู้ว่ากำลังทำอะไรอยู่",
  "Oops! An unknown error occurred. Please refresh the page, or visit from another browser or device": "อ๊ะ! เกิดข้อผิดพลาดที่ไม่รู้จัก โปรดรีเฟรชหน้าหรือเข้าจากเบราว์เซอร์หรืออุปกรณ์อื่น",
  "Open Source": "เปิดแหล่งข้อมูล",
  "Palm Bridge": "ปาล์ม บริดจ์",
  "Pending": "กำลังรอดำเนินการ",
  "Please connect to the appropriate Ethereum network.": "โปรดเชื่อมต่อกับเครือข่ายอีเธอร์เลียมที่เหมาะสม",
  "Please input a valid {0} wallet address": "โปรดป้อน {0} ที่อยู่บัญชีวอลเล็ท ที่ถูกต้อง",
  "Please switch to one of the networks listed below.": "กรุณาสับเปลี่ยนเป็นเครือข่ายอื่นตามลิสต์ที่แสดงดังนี้",
  "Pool tokens in rewards pool": "พูลโทเค็นในพูลรางวัล",
  "Pooled {0}": "พูล {0}",
  "Price Impact High": "ผลกระทบจากราคาอยู่ในระดับสูง",
  "Price Impact Too High": "ผลกระทบจากราคาอยู่ในระดับสูงมาก",
  "Price Updated": "ราคาอัพเดทเรียบร้อยแล้ว",
  "Proceed with the swap when all the confirmations have finished": "ทำการสลับเมื่อมีการยืนยันข้อมูลเสร็จสิ้น",
  "Processing": "กำลังประมวลผล",
  "Proposals": "ยื่นข้อเสนอ",
  "Received": "ได้รับเรียบร้อยแล้ว",
  "Recent Transactions": "รายการปัจจุบัน",
  "Recipient": "ผู้รับ",
  "Remove": "ลบ",
  "Ren": "เครือข่าย Ren",
  "Ren Burn Fee": "ค่าธรรมเนียมการแลก Ren",
  "Ren Mint Fee": "ค่าธรรมเนียมเหรียญ Ren",
  "Ren hash": "Ren แฮช ",
  "Ren status": "สถานะของเครือข่าย Ren",
  "Ren takes a {0}% fee per mint transaction. This is shared evenly between all active Ren dark nodes in the decentralized network.": "Ren มีค่าธรรมเนียม {0}% ต่อการแลกเหรียญ โดยถูกแบ่งปันอย่างยุติธรรมระหว่าง Ren ทั้งหมดที่ใช้งานอยู่ในเครือข่าย",
  "Ren takes a {0}% per burn transaction. This is shared evenly between all active Ren dark nodes in the decentralized network.": "Ren มีค่าธรรมเนียม {0}% ต่อการทำรายการครั้งใดครั้งหนึ่ง โดยถูกแบ่งปันอย่างยุติธรรมระหว่าง Ren ทั้งหมดที่ใช้งานอยู่ในเครือข่าย",
  "Retrieving {0} transaction from Ren": "กำลังดึงธุรกรรม {0} รายการจาก Ren",
  "Roll it back - this feature is not yet supported on {0}.": "ย้อนกลับ - ฟีเจอร์นี้ยังไม่ถูกใช้งาน {0}",
  "Route": "เส้นทาง",
  "Search name or paste address": "ค้นหาชื่อหรือวางที่อยู่",
  "Select a asset token": "เลือกสินทรัพย์โทเค็น",
  "Select a collateral token": "เลือกหลักประกันโทเค็น",
  "Select a network": "เลือกเครือข่าย",
  "Select a token": "เลือกโทเค็น",
  "Select a wallet": "เลือกกระเป๋าเงิน",
  "Send to:": "ส่งไปยัง",
  "Slippage tolerance": "ความคลาดเคลื่อนโดยรวม",
  "Status": "สถานะ",
  "Success": "สำเร็จ",
  "Sushi is a supporter of Open Source.": "ซูชิเป็นผู้สนับสนุนการเปิดแหล่งข้อมูล",
  "Swap": "สับเปลี่ยน",
  "Swap Anyway": "สับเปลี่ยนช่องทางอื่น",
  "Swap From (est.):": "เปลี่ยนจาก (สร้าง.)",
  "Swap From:": "เปลี่ยนจาก",
  "Swap To (est.):": "เปลี่ยนเป็น (สร้าง.)",
  "Swap To:": "เปลี่ยนเป็น",
  "Swap between Blockchains": "เปลี่ยนระหว่างบล็อคเชน",
  "Swappp": "เปลี่ยนนน",
  "Swappppp": "เปลี่ยนนนนน",
  "Switch network": "สลับเครือข่าย",
  "Telegram": "โทรเลข",
  "The Uniswap invariant x*y=k was not satisfied by the swap. This usually means one of the tokens you are swapping incorporates custom behavior on transfer.": "ค่าคงที่ Uniswap x*y=k เกิดความไม่พอใจในการแลกเปลี่ยน ซึ่งมักจะหมายถึงหนึ่งในโทเค็นที่คุณกำลังทำการแลกเปลี่ยนรวมถึงพฤติกรรมที่กำหนดเองในการโอน",
  "The address to which the funds will be sent.": "ที่อยู่สำหรับการโอนเงิน",
  "The fee(s) required by the {0} network, to move {1}. This does not go to Ren or the Ren team.": "ค่าธรรมเนียมที่ดำเนินการโดยเครือข่าย {0} เพื่อย้ายไปยัง {1} โดยค่าดำเนินการนี้ไม่ได้ไปถูกเรียกเก็บจาก Ren หรือทีม Ren",
  "The input token cannot be transferred. There may be an issue with the input token.": "ไม่สามารถโอนโทเค็นที่ป้อนได้ เกิดปัญหาจากโทเค็นที่ป้อน ",
  "The output token cannot be transferred. There may be an issue with the output token.": "ไม่สามารถโอนโทเค็นผลลัพท์ได้ เป็นปัญหาจากโทเค็นผลลัพท์",
  "The transaction could not be sent because the deadline has passed. Please check that your transaction deadline is not too low.": "ไม่สามารถส่งรายการดังกล่าวได้เนื่องจากเลยกำหนดเวลาที่สามารถส่งได้ไปแล้ว โปรดตรวจสอบว่ากำหนดเวลาในการทำรายการของคุณไม่ต่ำเกินที่กำหนดไว้",
  "This swap goes via Ren from the {inputNetwork} to the {outputNetwork} network. Enter your {outputNetwork} wallet address above.": "การสลับนี้ดำเนินการผ่าน Ren จากเครือข่าย {inputNetwork} ไปยังเครือข่าย {outputNetwork} ป้อนที่อยู่บัญชีวอลเล็ท {outputNetwork} ของคุณด้านบน",
  "This swap goes via Ren from the {inputNetwork} to the {outputNetwork} network. Send your assets to the gateway address below. Wait for the gateway transaction to settle before swapping.": "การสลับนี้ดำเนินการผ่าน Ren จากเครือข่าย {inputNetwork} ไปยังเครือข่าย {outputNetwork} ส่งทรัพย์สินของคุณไปยังที่อยู่เกตเวย์ด้านล่าง รอให้รายการเกตเวย์ดำเนินการเรียบร้อยจะทำการสลับ",
  "This token doesn't appear on the active token list(s). Make sure this is the token that you want to trade.": "โทเค็นนี้ไม่ปรากฏในรายการโทเค็นที่ใช้งานอยู่ ตรวจสอบให้แน่ใจว่านี่คือโทเค็นที่คุณต้องการเทรด",
  "This transaction will not succeed due to price movement. Try increasing your slippage tolerance.": "ธุรกรรมนี้จะไม่สำเร็จเนื่องจากการเปลี่ยนแปลงของราคา ลองเพิ่มควาดคลาดเคลื่อนโดยรวมใหม่อีกครั้ง",
  "This transaction will not succeed either due to price movement or fee on transfer. Try increasing your slippage tolerance.": "ธุรกรรมนี้จะไม่สำเร็จเนื่องจากการเปลี่ยนแปลงของราคาหรือค่าธรรมเนียมในการโอน ลองเพิ่มควาดคลาดเคลื่อนโดยรวมใหม่อีกครั้ง",
  "Tip to encourage miners to select this transaction.": "เคล็ดลับเพื่อสนับสนุนให้นักขุดเลือกรายการนี้ ",
  "To": "ถึง",
  "ToTx {0}": "ถึงTx {0}",
  "Tokens": "โทเค็นทั้งหมด",
  "Tokens from inactive lists. Import specific tokens below or\nclick Manage to activate more lists.": "โทเค็นจากรายการที่ไม่ใช้งาน นำเข้าโทเค็นเฉพาะด้านล่างหรือ\nคลิกจัดการเพื่อเปิดใช้งานรายการเพิ่มเติม",
  "Tools": "เครื่องมื่อทั้งหมด",
  "Tools to optimize your workflow.": "เครื่องมือเพื่อเพิ่มประสิทธิภาพในการจัดการเอกสารของคุณ",
  "Transaction Hash": "เข้ารหัส",
  "Transaction Settings": "การตั้งค่ารายการ",
  "Transaction Submitted": "รายการสำเร็จเรียบร้อย",
  "Transaction deadline": "กำหนดเวลาการทำรายการ",
  "Turn On Expert Mode": "เปิดใช้โหมดผู้เชี่ยวชาญ",
  "Twitter": "ทวิตเตอร์",
  "Unknown error{0}.": "ข้อผิดพลาดที่ไม่รู้จัก{0}.",
  "Unsupported Asset": "ไม่สนับสนุนสินทรัพย์นี้",
  "Unwrap": "เปิด",
  "VarenX Fee": "ค่าธรรมเนียม VarenX",
  "VarenX takes a 0.05% fee on mint and burn transactions": "VarenX คิดค่าบริการ 0.05% fee สำหรับการทำธุรกรรมเหรียญและการทำรายการ",
  "View on explorer": "ดูในเบราว์เซอร์",
  "View transaction": "ดูรายการ",
  "Waiting for Confirmation": "กำลังรอการยืนยัน",
  "Waiting for the necessary confirmations...": "กำลังรอการยืนยันที่จำเป็น...",
  "We found a swap in progress!": "เราพบการแลกเปลี่ยนระหว่างการดำเนินการ!",
  "Wrap": "ปิดบัง",
  "Wrong Network": "เครือข่ายไม่ถูกต้อง",
  "You are connected with the {currentNetwork} network, which is currently not supported by {varenX}.": "คุณทำการเชื่อมต่อกับเครือข่าย {currentNetwork} ซึ่งขณะนี้ {varenX} ไม่รองรับเครือข่ายดังกล่าว",
  "You are on the wrong network": "คุณใช้เครือข่ายไม่ถูกต้อง",
  "You must deposit {0} to this\ngateway address to continue!": "คุณต้องฝากเงิน {0} ไปยัง \n ที่อยู่เกตเวย์นี้เพื่อดำเนินการต่อ!",
  "Your pool share": "ส่วนแบ่งพูดของคุณ",
  "Your total pool tokens": "จำนวนโทเค็นทั้งหมดในพูลของคุณ",
  "Your transaction may be frontrun": "รายการของคุณอาจเป็นการซื้อขายแบบตัดหน้า",
  "Your transaction may fail": "รายการของคุณอาจจะล้มเหลว",
  "Your transaction will revert if it is pending for more than this long.": "รายการของคุณจะถูกคืนกลับมาหากใช้เวลารอนานกว่าที่กำหนด",
  "Your transaction will revert if the price changes unfavorably by more than this percentage.": "การทำธุรกรรมของคุณจะถูกเปลี่ยนกลับหากราคาเปลี่ยนแปลงไปในทางที่ไม่น่าพึงพอใจมากกว่าเปอร์เซ็นต์ความคลาดเคลื่อนที่กำหนดไว้",
  "Your transactions will appear here...": "รายการของคุณจะปรากฏตรงนี้...",
  "failed to load": "ล้มเหลวในการโหลดข้อมูล",
  "home page": "โฮมเพจ",
  "loading...": "กำลังโหลดข้อมูล...",
  "max": "สูงสุด",
  "minutes": "นาที",
  "retry": "ลองใหม่อีกครั้ง",
  "xDai Bridge": "เอ็กได บริดจ์",
  "{0, plural, one {Token} many {Tokens}}": "{0, plural, one {Token} many {Tokens}}",
  "{0} Miner Fee": "{0} ค่าธรรมเนียมการขุดเหรียญ",
  "{0} network": "{0} เครือข่าย",
  "{0} wallet address...": "{0} ที่อยู่บัญชีวอลเล็ท...",
  "{0}.": "{0}."
}
